app/controllers/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "New item"], ["list_id", 1], ["created_at", "2016-08-07 04:44:15.988290"], ["updated_at", "2016-08-07 04:44:15.988290"]]
---
  def create
    @list = List.find(params[:list_id])
    @item = @list.items.build(item_params)
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 1], ["updated_at", "2016-08-08 02:39:54.420726"], ["id", 3]]
---
  def update
    #find item
    @item = Item.find(params[:id])
    @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 3]]
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy