app/controllers/lists_controller.rb

  def index
    @list = List.new
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def create
    @list = List.new(list_params)
    @list.name = params[:list][:name]
    if @list.save
      redirect_to list_url(@list)
    else
      @lists = List.all
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "New List"], ["created_at", "2016-08-07 03:34:18.011717"], ["updated_at", "2016-08-07 03:34:18.011717"]]
SELECT "lists".* FROM "lists"